org/draft/qmq系统.org
* 一致性
  qmq系统的作用是希望业务流程跟消息发送是一致的。当业务成功时，消息可靠发出去。当业务失败时，消息也不会发出。保证无论是先发送消息还是先处理业务，消息跟业务的状态是一致的
* 同一个事务
  在业务使用的数据库实例上创建了一个消息表，业务写业务数据到业务表，消息写到消息表，这两个动作是在同一个事务中的。这样就保证了业务跟消息状态是一致的。然后有一个线程池将各个业务系统的消息拉倒真正的消息系统中，同时将业务系统中的消息删掉。同时有一个定时任务去消费消息系统中的消息。qmq的真正的消息系统是基于数据库的：可靠性一致，存储类型一致。
  - 队列
  - 消息分组
